# Словарь для описаний погоды на русском
weather_descriptions_russian = {
    'clear sky': '🌞 ясное небо',
    'few clouds': '🌤️ небольшая облачность',
    'scattered clouds': '⛅ рассеянные облака',
    'broken clouds': '⛅ облачно с прояснениями',
    'shower rain': '🌦️ кратковременный дождь',
    'rain': '🌧️ дождь',
    'thunderstorm': '🌩️ гроза',
    'snow': '🌨️ снег',
    'mist': '🌫️ туман'
}

# Словарь для вероятности осадков на русском
precipitation_probabilities_russian = {
    'N/A': 'нет данных',
    '0': 'нет вероятности',
    '10': '10%',
    '20': '20%',
    '30': '30%',
    '40': '40%',
    '50': '50%',
    '60': '60%',
    '70': '70%',
    '80': '80%',
    '90': '90%',
    '100': '100%'
}